In [14]:
marks=pd.Series([45,65,98],index=["python","dbms","dsa"])
marks

python    45
dbms      65
dsa       98
dtype: int64

In [15]:
marks.values

array([45, 65, 98], dtype=int64)

In [16]:
marks.keys()

Index(['python', 'dbms', 'dsa'], dtype='object')

In [17]:
k={"name":"kevin","course":"bca","address":"vadodara"}
student=pd.Series(k)
student

name          kevin
course          bca
address    vadodara
dtype: object

In [18]:
student.keys()

Index(['name', 'course', 'address'], dtype='object')

In [19]:
df1=pd.DataFrame(np.random.randint(1,100,(4,3)),columns=['python','datas science','dbms',],index=['riya','kevin','devang','halar'])
df1

        python  datas science  dbms
riya        75             48    89
kevin       83             54    96
devang      75             93    58
halar        4             66    29

In [20]:
df1['python']>40

riya       True
kevin      True
devang     True
halar     False
Name: python, dtype: bool

In [21]:
df1[df1['python']>40]

        python  datas science  dbms
riya        75             48    89
kevin       83             54    96
devang      75             93    58

In [22]:
df1.loc[df1['python']>40,'python']

riya      75
kevin     83
devang    75
Name: python, dtype: int32

In [23]:
df1+2

        python  datas science  dbms
riya        77             50    91
kevin       85             56    98
devang      77             95    60
halar        6             68    31

In [24]:
df1

        python  datas science  dbms
riya        75             48    89
kevin       83             54    96
devang      75             93    58
halar        4             66    29

In [25]:
df2=(df1+2)
df2

        python  datas science  dbms
riya        77             50    91
kevin       85             56    98
devang      77             95    60
halar        6             68    31

In [26]:
df2

        python  datas science  dbms
riya        77             50    91
kevin       85             56    98
devang      77             95    60
halar        6             68    31

In [27]:
df2=(df1+50)
df2

        python  datas science  dbms
riya       125             98   139
kevin      133            104   146
devang     125            143   108
halar       54            116    79

In [28]:
df2[df2>100]=100
df2

        python  datas science  dbms
riya       100             98   100
kevin      100            100   100
devang     100            100   100
halar       54            100    79

In [29]:
#df2.where(df2>100,100)

In [30]:
df2[(df2['python']>90) & (df2['datas science']>30)]

        python  datas science  dbms
riya       100             98   100
kevin      100            100   100
devang     100            100   100

In [31]:
df2[df2.index.str.startswith('d')]

        python  datas science  dbms
devang     100            100   100

In [32]:
df2[df2.index.str.endswith('a')]

      python  datas science  dbms
riya     100             98   100

In [33]:
df2["percenatage"]=((df2['python']+df2['datas science']+df2['dbms']))/300*100
df2

        python  datas science  dbms  percenatage
riya       100             98   100    99.333333
kevin      100            100   100   100.000000
devang     100            100   100   100.000000
halar       54            100    79    77.666667

In [34]:
df2["total"]=df2['python']+df2['datas science']+df2['dbms']
df2

        python  datas science  dbms  percenatage  total
riya       100             98   100    99.333333    298
kevin      100            100   100   100.000000    300
devang     100            100   100   100.000000    300
halar       54            100    79    77.666667    233

In [35]:
#important question

In [36]:
df2.loc[df2['percenatage']>34,'result']='pass'
df2

        python  datas science  dbms  percenatage  total result
riya       100             98   100    99.333333    298   pass
kevin      100            100   100   100.000000    300   pass
devang     100            100   100   100.000000    300   pass
halar       54            100    79    77.666667    233   pass

In [ ]:
#15. Calculate percentage based grade value (per>=90 then A-grade, per>=80 then B-grade,
per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then Fgrade)

In [43]:
df2.loc[df2['percenatage']>90,'grade']='A'
df2.loc[df2['percenatage']<90,'grade']='B'
df2.loc[df2['percenatage']<80,'grade']='C'
df2.loc[df2['percenatage']<70,'grade']='D'
df2.loc[df2['percenatage']<60,'grade']='E'
df2.loc[df2['percenatage']<50,'grade']='F'
df2

        python  datas science  dbms  percenatage  total result grade
riya       100             98   100    99.333333    298   pass     A
kevin      100            100   100   100.000000    300   pass     A
devang     100            100   100   100.000000    300   pass     A
halar       54            100    79    77.666667    233   pass     C

In [ ]:
#task2

In [5]:
import pandas as pd
import Salaries as sal

ModuleNotFoundError: No module named 'Salaries'

In [2]:
sal = pd.read_csv('Salaries.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'Salaries.csv'

In [3]:
sal.head()

NameError: name 'sal' is not defined

In [4]:
sal.info() # 148654 Entries

NameError: name 'sal' is not defined